android-sdk-platform-tools
anydesk-bin
archlinux-themes-sddm
auto-cpufreq
bass-fish
bluetuith
cpulimit
downgrade
dragon-drop
duckdb-bin
flamegraph
flyctl-bin
fnm-bin
google-chrome
gopsuinfo-debug
heroku-cli-bin
ideapad-cm
js78
julia-bin
jupyter-server-ydoc
ldtk
lf-bin
libresprite-appimage
librewolf-bin
llvm15
megacmd
miniconda3
mons
ngrok
nohang
nwg-bar-bin
nwg-dock-hyprland-bin
octave-nan
octave-statistics
optimus-manager
pass-update
payload-dumper-go-bin
pgvector
pixelflasher
pmount-safe-removal
popcorntime-bin
prelockd
python-async_generator
python-backcall
python-pyrsistent
python-webio-jupyter-extension
qpdfview
revanced-cli-bin
sddm-sugar-candy-git
swaync-debug
teams
tofi
typora
upass
uresourced
webcord
yay-bin
zigmod-bin
